{ "news" : [

    {
        "title": "Electoral bonds case: SBI share price sees major dip after Supreme Court raps bank",
        "subtitle":  "After Supreme Court rapped SBI for seeking an extension in the electoral bonds deadline, the share price of the bank saw a significant dip.",
        "image_url": "https://i0.wp.com/bankworkersunity.com/wp-content/uploads/2022/05/SBI.jpg?fit=1000%2C506&ssl=1",
        "date": "11th March, 2024",
        "Author": "John Doe",
        "description": "The Supreme Court on Monday rejected the State Bank of India's plea seeking an extension of the deadline to disclose the data linked to electoral bonds. Shortly after the apex court's verdict, the shares of SBI suffered a significant dip. SBI shares saw a dip of nearly 2 percent soon after the Supreme Court dismissed its plea and ordered the bank to present the data by tomorrow, March 12. At 3:30 pm, SBI shares stood at ₹773, seeing a dip of ₹15 from the previous close. SBI's intraday low was recorded at ₹771, which was 2 percent lower than the previous day. Experts believe that the shares of the central bank dropped not just because of the Supreme Court verdict, but also due to the weak sentiments in the Indian stock market, reported Mint. Experts also suggested that the dip in the share prices of SBI should not have a lasting impact on the PSU banking sector and should be viewed as an opportunity for medium and long-term investors. A five-judge Constitution bench -- comprising Chief Justice of India DY Chandrachud and Justices Sanjiv Khanna, BR Gavai, JB Pardiwala, Manoj Misra -- on Monday ordered that the State Bank of India disclose all the details linked to the electoral bonds on March 12. The Supreme Court rejected SBI's plea for an extension of deadline to declare the electoral bonds data till June 30. The deadline for the same had been set at March 6 by the apex court in the previous hearing, and ECI was ordered to publish the data by March 13. Passing the order on SBI's application today, the bench ordered, 'Submissions of SBI in application indicates that information sought is readily available. Thus, the application by SBI seeking extension of time until June 30 is dismissed. SBI is directed to disclose the details by the close of business hours of March 12, 2024.'"
    },
    {
        "title": "Bengaluru News Live Updates: Amid severe drought, Deputy CM D K Shivakumar asserts no Cauvery water release to Tamil Nadu",
        "subtitle": "Bengaluru News Live Updates (March 11): Amid criticism and protests against the government over allegations that Cauvery water was being released from Krishnaraja Sagar (KRS) dam to Tamil Nadu, he clarified that the discharge was meant for Bengaluru.",
        "image_url": "https://img.staticmb.com/mbcontent/images/crop/uploads/2023/4/Bangalore-inner-road_0_1200.jpg",
        "date": "11th March, 2024",
        "Author": "John Doe",
        "description": "Karnataka Deputy Chief Minister D K Shivakumar asserted on Monday there is no question of releasing Cauvery river water to Tamil Nadu at any cost now, reported PTI. Amid criticism and protests against the government over allegations that Cauvery water was being released from Krishnaraja Sagar (KRS) dam to Tamil Nadu, he clarified that the discharge was meant for Bengaluru, and not for the neighbouring state. “There is no question of releasing Cauvery river water to Tamil Nadu now at any cost, we have not left (released)….How much water flows to Tamil Nadu, there is an account for it,” Shivakumar, who is also the water resources minister said. In other news, Chief Minister Siddaramaiah said yesterday that former Prime Minister and Janata Dal (Secular) supremo HD Deve Gowda chose to align with the BJP to ensure the survival of his party, reported ANI. “Deve Gowda is praising Narendra Modi now. He also says that he and Narendra Modi have an inseparable relationship. I wonder why he has become like this,” Siddaramaiah said."
    },
    {
        "title": "CAA rules to be notified today, say home ministry sources",
        "subtitle": "Kearse, 26, signed with the Lions in March after four seasons in Minnesota, where he played in 62 games with five starts, making 79 tackles and defending eight passes.",
        "image_url": "https://www.livemint.com/lm-img/img/2023/07/11/1600x900/The-delegation-apprised-Amit-Shah-on-the-apprehens_1689087322099_1689087339045.jpg",
        "date": "11th March, 2024",
        "Author": "John Doe",
        "description": "The Ministry of Home Affairs (MHA) is expected to notify the regulation for the  Citizenship (Amendment) Act (CAA) on Monday, sources told LiveMint. The CAA laws were introduced by the Narendra Modi government in 2019 to allow eligible individuals to obtain Indian citizenship. The amendment in the Citizenship Act was followed by a massive protest in India against the move. To necessitate the entire process of applying for citizenship under CAA rules, an online portal has been prepared to facilitate the whole process digitally, an official told news agency ANI. The regulations are prepared, and an online portal is already set up for the entire process, which will be conducted digitally. Applicants will need to disclose the year of their entry into India without any travel documents. No additional documentation will be required from the applicants, ANI quoted the official as saying. Meanwhile, Prime Minister Narendra Modi will address the nation on Monday evening ahead of the Lok Sabha elections. There are chances of some big announcements by the Prime Minister in his address. 'ABOUT CAA LAWS' - The CAA rules confer Indian citizenship to persecuted non-Muslim migrants - including Hindus, Sikhs, Jains, Buddhists, Parsis, and Christians - who migrated from Bangladesh, Pakistan, and Afghanistan and arrived in India before December 31, 2014. According to an official, the CAA law can be implemented by a notification from the Ministry of Home Affairs, opening doors for eligible individuals to seek Indian citizenship. To complete the process of framing the rules associated with the CAA legislation, the Ministry of Home Affairs has been regularly seeking extensions from the parliamentary committees to continue the process of framing the rules associated with the legislation. The extensions have been given as per the manual of parliamentary procedure, which makes the formulation of guidelines mandatory within six months of receiving the presidential assent. Otherwise, the government should have sought an extension from the Committees on Subordinate Legislation in both the Lok Sabha and Rajya Sabha."
    }
]}
